{
    "feelings": ["Hey! Do you want to share your feelings with me?",
                ["How pleasant are those feelings", "Okay. Have a nice day!"], 
                "What about energy, how energized do you feel?", 
                "What would you like to do know?", 
                ["Really? Maybe we could also try another activity?", "Cool choice!"], 
                "Nice!"],

    "user_data": ["What do you want to do?", ["Do you want to delete your data?", 
                "It's used to improve the ability of the chatbot to detect the intent and feelings of the users so it can provide a better service",
                "The questions asked are based on the data the chatbot gets from the conversations with the users"]],

    "malfunction": ["What is the problem with the chatbot?", 
                ["How is the chatbot being %s?", "Could you explain the problem?"], 
                "Thank you for you input!"],


    "profile_data": ["Okay, your data has been deleted", "Do you want to delete your data?", "How often do you want your reminders?"],

    "talk_about": [["I wanted to check in with you. You seem pretty down lately", "Recently, I've noticed some differences in you and wondered how you're doing"],
                [["Did something happen that made you start feeling this way?", "What set off these feelings?"], "Thanks, if you need me I'm here for you!"], 
                ["When did you begin feeling like this?", "It might be hard to believe right now, but they way you are feeling will change"], 
                "It was nice hearing from you! If you need me in the future, let me know!"],

    "reconnect_present": [["Why don't we try this quick exercise?", 
                        "Maybe it could be helpful if we write a short-term list...", 
                        "Tell me three things you are grateful for today"],
                        ["Let's start by sitting down and closing your eyes. Then start feeling the weight of the different parts of your body, feel your fingers and toes. Little by little you're becoming more aware of your body", 
                        "That's great :D", 
                        "Cool, I'm listening!", 
                        "Enjoy your day! If you need me, I'm here for you :D"],
                        "Thank you! It was nice hearing from you"],

    "suggest_activity": [["It seems like you have too much energy today", 
                        "It seems like you don't have enough energy today"],
                        ["Why don't you try %s?", "How energized do you feel"],
                        "How pleasant are those feelings?",
                        "What activity do you feel like doing now?",
                        ["Really? Maybe we could also try another activity?", "Cool choice!"],
                        "Nice!"],

    "user_phase_2": ["What do you want to do?", ["What do you want to change?", 
                "It's used to improve the ability of the chatbot to detect the intent and feelings of the users so it can provide a better service"]],

    "why_activity": ["I suggested %s because %s %s %s you also had %s energy and wanted to do that activity so I thought it could help today",
                "I suggested %s because %s %s %ss ago you also had %s energy and wanted to do that activity so I thought it could help today", 
                "The activities suggested are based on the data on your user profile"],

    "why_reminder": ["I sent you this reminder because I noticed that in the %ss you usually have %s energy"],

    "why_talk": ["You seemed to have %s energy and I thought talking about it could help you"],

    "why_present": ["I suggested you to%s because it seemed you were distressed and this activity can help you to focus on the present moment again"],

    "buttons": {"yes_no": [["Yes"], ["No"]],

                "valence": [["Very pleasant"], ["Somewhat pleasant"], 
                    ["It is okay"], ["Somewhat unpleasant"], ["Very unpleasant"]],

                "activation": [["Very energized"], ["Somewhat energized"], 
                    ["Neither of them"], ["Somewhat tired"], ["Very tired"]],

                "malfunction": [["Repetitive"], ["Unclear"], 
                    ["Disrespectful"], ["Illogical"],
                    ["Other"]],

                "data": [["Manage my data"], ["How is my data being used?"],
                    ["Why certain questions are asked?"]],

                "data_2": [["Manage my data"], ["How is my data being used?"],
                    ["Why did you suggest that activity?"]],

                "profile": [["Delete data"], ["Manage reminders"]],

                "other": [["Why did you ask me if I wanted to talk about my feelings?"],
                    ["Why did you suggest me to write a short-term list?"],
                    ["Why did you suggest me to tell you three things I am grateful for today?"],
                    ["Why did you suggest me to try that quick activity?"],
                    ["Why did you send me that reminder?"]],

                "reminder": [["Daily"], ["I don't want reminders"]],

                "talk": [["I want to talk about it"], ["I don't want to talk about it"]]}
}